In [1]:
import numpy as np
import pandas as pd

In [6]:
test_df = pd.read_csv('test1.csv', sep=";")

In [7]:
test_df.head()

  Unnamed: 0  Col1  Col2  Col3  Col4
0       Row1     0     1     2     3
1       Row2     4     5     6     7
2       Row3     8     9    10    11
3       Row4    12    13    14    15
4       Row5    16    17    18    19

In [4]:
df=pd.read_csv('mercedesbenz.csv')

In [5]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [7]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

## CSV

In [8]:
from io import StringIO, BytesIO

In [9]:
data = ('col1,col2,col3\n'
            'x,y,1\n'
            'a,b,2\n'
            'c,d,3')

In [10]:
type(data)

str

In [11]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [13]:
# Read from specific columns
df = pd.read_csv(StringIO(data), usecols = ['col1','col2'])

In [14]:
df

  col1 col2
0    x    y
1    a    b
2    c    d

In [15]:
df.to_csv('Test.csv')

In [16]:
# Specifying columns data types

In [17]:
data = ('a,b,c,d \n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11')

In [18]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [19]:
df = pd.read_csv(StringIO(data),dtype=object)

In [20]:
df

   a   b   c   d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [21]:
df['a'][2]

'9'

In [22]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [23]:
df = pd.read_csv(StringIO(data),dtype=float)

In [24]:
df

     a     b     c   d
0  1.0   2.0   3.0  4.0
1  5.0   6.0   7.0  8.0
2  9.0  10.0  11.0  NaN

In [25]:
df['a']

0    1.0
1    5.0
2    9.0
Name: a, dtype: float64

In [27]:
df = pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'Int64'})

In [28]:
df

   a   b     c   d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [29]:
type(df['a'][1])

numpy.int64

In [32]:
df.dtypes

a       Int64
b       int32
c     float64
d     float64
dtype: object

In [ ]:
## Index columns and training delimiters

In [35]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [37]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [49]:
data = ('a,b,c\n'
          '4,apple,bat\n'
          '8,orange,cow')

In [50]:
pd.read_csv(StringIO(data))

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [51]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [52]:
## Combining usecols and indexcol
data = ('a,b,c\n'
          '4,apple,bat\n'
          '8,orange,cow')

In [53]:
pd.read_csv(StringIO(data),usecols = ['b','c'],index_col = False)

        b    c
0   apple  bat
1  orange  cow

In [56]:
## Quoting and Escape Character.Very useful in NLP
data = 'a,b\n"hello, \\"Bob\\",nice to see you",5'

In [57]:
pd.read_csv(StringIO(data),escapechar = '\\')

                              a  b
0  hello, "Bob",nice to see you  5

In [58]:
## URL to CSV
df = pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [59]:
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359

In [60]:
df.describe()

       display_level  sort_sequence
count     400.000000     400.000000
mean        3.195000     200.500000
std         1.815272     115.614301
min         0.000000       1.000000
25%         2.000000     100.750000
50%         3.000000     200.500000
75%         4.000000     300.250000
max         8.000000     400.000000